In [37]:
import pandas as pd
import numpy as np

In [38]:
df=pd.DataFrame({'key':list("ABCABC"),
              'data1':[np.random.randint(1,10) for i in range(6)],
              'data2':[np.random.randint(1,10) for i in range(6)]})
df

  key  data1  data2
0   A      7      3
1   B      2      1
2   C      4      7
3   A      2      5
4   B      5      3
5   C      7      3

In [39]:
df.groupby('key').aggregate({'data1':'min',
                            'data2':'max'})

     data1  data2
key
A        2      5
B        2      3
C        4      7

In [40]:
def norm_by_data2(x):
    x["data1"]/=x['data2'].sum()
    return x
df

  key  data1  data2
0   A      7      3
1   B      2      1
2   C      4      7
3   A      2      5
4   B      5      3
5   C      7      3

In [41]:
df.groupby("key").apply(norm_by_data2)

  key  data1  data2
0   A  0.875      3
1   B  0.500      1
2   C  0.400      7
3   A  0.250      5
4   B  1.250      3
5   C  0.700      3

In [103]:
L=[0,1,0,1,2,0]

In [43]:
df.groupby("key")["data1"].aggregate([np.min,np.mean,np.median,np.max])

     amin  mean  median  amax
key
A       2   4.5     4.5     7
B       2   3.5     3.5     5
C       4   5.5     5.5     7

In [44]:
df.groupby("key").aggregate([np.min,np.mean,np.median,np.max])

    data1                  data2
     amin mean median amax  amin mean median amax
key
A       2  4.5    4.5    7     3    4      4    5
B       2  3.5    3.5    5     1    2      2    3
C       4  5.5    5.5    7     3    5      5    7

In [55]:
def filter_func(x):
    return x['data2'].std()>2

In [61]:
df.groupby('key').filter(filter_func)

  key  data1  data2
2   C      4      7
5   C      7      3

In [59]:
df.groupby("key")["data2"].std()

key
A    1.414214
B    1.414214
C    2.828427
Name: data2, dtype: float64

In [63]:
df.groupby('key').transform(lambda x: x+x.mean())

   data1  data2
0   11.5    7.0
1    5.5    3.0
2    9.5   12.0
3    6.5    9.0
4    8.5    5.0
5   12.5    8.0

In [78]:
def norm_by_data2(x):
    x['data1']/=x['data2'].sum()
    x['data2']/=x['data1'].sum()
    return x

In [95]:
df.groupby('key').apply(norm_by_data2)

  key  data1     data2
0   A  0.875  2.666667
1   B  0.500  0.571429
2   C  0.400  6.363636
3   A  0.250  4.444444
4   B  1.250  1.714286
5   C  0.700  2.727273

In [114]:
df.groupby([1,1,3,3,5,5]).sum()

   data1  data2
1      9      4
3      6     12
5     12      6